

<!DOCTYPE html>
<html lang="zh">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="记录所学所想，只为拾遗补缺">
    <title>Redis分布式部署方案 | Mustone&#39;s blog</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;Redis&amp;#x662F;&amp;#x4E00;&amp;#x6B3E;&amp;#x5F00;&amp;#x6E90;&amp;#x7684;&amp;#x57FA;&amp;#x4E8E;&amp;#x5185;&amp;#x5B58;&amp;#x7684;K-V&amp;#x578B;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#xFF0C;&amp;#x56E0;">
<meta property="og:type" content="article">
<meta property="og:title" content="Redis分布式部署方案">
<meta property="og:url" content="https://yongjiang043.github.io/2020/06/16/Redis分布式部署方案/index.html">
<meta property="og:site_name" content="Mustone&#39;s blog">
<meta property="og:description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;Redis&amp;#x662F;&amp;#x4E00;&amp;#x6B3E;&amp;#x5F00;&amp;#x6E90;&amp;#x7684;&amp;#x57FA;&amp;#x4E8E;&amp;#x5185;&amp;#x5B58;&amp;#x7684;K-V&amp;#x578B;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#xFF0C;&amp;#x56E0;">
<meta property="og:locale" content="zh">
<meta property="og:image" content="https://yongjiang043.github.io/2020/06/16/Redis分布式部署方案/cluster.jpg">
<meta property="og:image" content="https://yongjiang043.github.io/2020/06/16/Redis分布式部署方案/buffer.jpg">
<meta property="og:updated_time" content="2020-06-16T12:42:04.269Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Redis分布式部署方案">
<meta name="twitter:description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;Redis&amp;#x662F;&amp;#x4E00;&amp;#x6B3E;&amp;#x5F00;&amp;#x6E90;&amp;#x7684;&amp;#x57FA;&amp;#x4E8E;&amp;#x5185;&amp;#x5B58;&amp;#x7684;K-V&amp;#x578B;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#xFF0C;&amp;#x56E0;">
<meta name="twitter:image" content="https://yongjiang043.github.io/2020/06/16/Redis分布式部署方案/cluster.jpg">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "mustone",
  "url": "https://yongjiang043.github.io"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>Mustone&#39;s blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">mustone</a>
                    
                        <div class="meta">
                            始于代码，善其身而济天下
                        </div>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        <div class="item">
                            <i class="marker icon" style="float: left"></i>
                            <div class="content">杭州</div>
                        </div>
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        

                                <a href="https://github.com/yongjiang043"><i class="large github icon" style="float: left"></i></a>

                            

                                <a href="https://weibo.com/whateveritis"><i class="large weibo icon" style="float: left"></i></a>

                            
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-Redis分布式部署方案" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    Redis分布式部署方案
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x5E03;&#x5F0F;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x5E03;&#x5F0F;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x5E03;&#x5F0F;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x5E03;&#x5F0F;</h2><p>Redis&#x662F;&#x4E00;&#x6B3E;&#x5F00;&#x6E90;&#x7684;&#x57FA;&#x4E8E;&#x5185;&#x5B58;&#x7684;K-V&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x5FEB;&#xFF0C;&#x4E00;&#x822C;&#x88AB;&#x7528;&#x6765;&#x505A;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x5B58;&#x3002;</p>
<p>Redis&#x4F5C;&#x4E3A;&#x5355;&#x673A;&#x90E8;&#x7F72;&#x80FD;&#x591F;&#x652F;&#x6301;&#x4E1A;&#x52A1;&#x7B80;&#x5355;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4E00;&#x65E6;&#x7CFB;&#x7EDF;&#x89C4;&#x6A21;&#x4E0A;&#x6765;&#xFF0C;&#x5355;&#x673A;&#x7684;Redis&#x5C31;&#x4F1A;&#x9047;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x6311;&#x6218;&#xFF1A;</p>
<ul class="ui list">
<li>&#x4F38;&#x7F29;&#x6027;&#x3002;&#x7CFB;&#x7EDF;&#x968F;&#x7740;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x4E0E;&#x4E1A;&#x52A1;&#x589E;&#x957F;&#xFF0C;&#x5BF9;Redis&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x91CF;&#x9700;&#x6C42;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5355;&#x673A;&#x5FC5;&#x7136;&#x53D7;&#x9650;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5185;&#x5B58;&#x4E0E;&#x78C1;&#x76D8;&#x5927;&#x5C0F;&#x3002;</li>
<li>&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x7CFB;&#x7EDF;&#x89C4;&#x6A21;&#x53D8;&#x5927;&#x540E;&#xFF0C;&#x5BF9;Redis&#x7684;&#x541E;&#x5410;&#x91CF;&#x9700;&#x6C42;&#x4E5F;&#x4F1A;&#x63D0;&#x9AD8;&#xFF0C;&#x800C;&#x5355;&#x673A;&#x7684;&#x541E;&#x5410;&#x91CF;&#x5FC5;&#x7136;&#x6709;&#x9650;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4F1A;&#x5F71;&#x54CD;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x3002;</li>
<li>&#x9AD8;&#x53EF;&#x7528;&#x3002;Redis&#x6301;&#x4E45;&#x5316;&#x673A;&#x5236;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x80FD;&#x7F13;&#x89E3;&#x5355;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x53BB;&#x6062;&#x590D;&#xFF0C;&#x5728;&#x6062;&#x590D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x6570;&#x636E;&#x4F1A;&#x6709;&#x4E22;&#x5931;&#x3002;</li>
</ul>
<h2 id="&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h2><p>&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5BF9;&#x4E8E;&#x4E1A;&#x5185;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF1A;</p>
<ul class="ui list">
<li>&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x3002;&#x5355;&#x70B9;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6311;&#x6218;&#x5C31;&#x662F;&#x6570;&#x636E;&#x91CF;&#x5927;&#x7684;&#x65F6;&#x5019;&#x5355;&#x70B9;&#x5B58;&#x50A8;&#x4E0D;&#x591F;&#x3002;&#x76F4;&#x63A5;&#x7684;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#x90E8;&#x7F72;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5C06;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x5206;&#x6563;&#x5B58;&#x50A8;&#x5230;&#x5404;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E2D;&#x3002;&#x5F53;&#x5B9E;&#x4F8B;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#x65F6;&#xFF0C;&#x7EE7;&#x7EED;&#x6269;&#x5927;&#x5B9E;&#x4F8B;&#x4E2A;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6570;&#x636E;&#x4F38;&#x7F29;&#x6027;&#x95EE;&#x9898;&#x3002;&#x540C;&#x65F6;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5355;&#x673A;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x8BFB;&#x5199;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</li>
<li>&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x3002;&#x5982;&#x679C;&#x53EA;&#x6709;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x51FA;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x8BE5;&#x5B9E;&#x4F8B;&#x4E0A;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4E0D;&#x53EF;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x53EF;&#x7528;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x6B64;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6240;&#x6709;&#x6570;&#x636E;&#x7684;&#x4E3B;&#x5907;&#x590D;&#x5236;&#xFF0C;&#x540C;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x5B9E;&#x4F8B;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x542F;&#x7528;&#x8BE5;&#x5B9E;&#x4F8B;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x8FBE;&#x5230;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x76EE;&#x7684;&#x3002;&#x540C;&#x65F6;&#x526F;&#x672C;&#x4E5F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x53D1;&#x5230;&#x526F;&#x672C;&#x4E0A;&#x3002;</li>
</ul>
<p>&#x5B58;&#x50A8;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5927;&#x62B5;&#x5982;&#x4E0A;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x5404;&#x79CD;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x4E0D;&#x540C;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;Redis&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x600E;&#x6837;&#x7684;&#x3002;</p>
<h3 id="&#x5386;&#x53F2;&#x53D1;&#x5C55;"><a href="#&#x5386;&#x53F2;&#x53D1;&#x5C55;" class="headerlink" title="&#x5386;&#x53F2;&#x53D1;&#x5C55;"></a>&#x5386;&#x53F2;&#x53D1;&#x5C55;</h3><p>&#x5206;&#x5E03;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E0D;&#x662F;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x4E2A;&#x53D1;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x540C;&#x5386;&#x53F2;&#x65F6;&#x671F;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x6700;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E5F;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x8FDC;&#x7684;&#x5C06;&#x6765;&#x88AB;&#x66FF;&#x6362;&#x3002;</p>
<p>&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#xFF08;replication&#xFF09;&#x662F;Redis&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x3002;Redis&#x4E2D;&#x5305;&#x542B;&#x4E24;&#x79CD;&#x8282;&#x70B9;&#xFF1A;master&#x8282;&#x70B9;&#x4E0E;slave&#x8282;&#x70B9;&#x3002;&#x540C;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;master&#x4E0E;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#x4E0A;&#xFF0C;<br>master&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x8BFB;&#x5199;&#xFF0C;slave&#x4E0D;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x5F53;master&#x5B95;&#x673A;&#x65F6;&#xFF0C;slave&#x8282;&#x70B9;&#x8FD8;&#x80FD;&#x7EE7;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x4E3B;&#x4ECE;&#x6570;&#x636E;&#x5982;&#x4F55;&#x540C;&#x6B65;&#x3002;</p>
<p>Redis&#x7684;&#x4E3B;&#x4ECE;&#x540C;&#x6B65;&#x5206;&#x4E3A;&#x5168;&#x91CF;&#x540C;&#x6B65;&#x4E0E;&#x589E;&#x91CF;&#x540C;&#x6B65;&#xFF0C;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#xFF0C;&#x5F53;master&#x5B95;&#x673A;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8FD0;&#x7EF4;&#x4EBA;&#x5DE5;&#x5C06;slave&#x8282;&#x70B9;&#x5207;&#x6362;&#x6210;master&#x3002;&#x8FD9;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x8FC7;&#x7A0B;&#x4E2D;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x3002;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x673A;&#x5236;&#xFF0C;&#x5F53;master&#x5B95;&#x673A;&#x65F6;&#x80FD;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x611F;&#x77E5;&#xFF0C;&#x7EE7;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x4E8E;&#x662F;Redis&#x5B98;&#x65B9;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x65B9;&#x6848;: Redis Sentinel&#xFF08;&#x54E8;&#x5175;&#x6A21;&#x5F0F;&#xFF09;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x7684;&#x8BF4;&#xFF0C;&#x54E8;&#x5175;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x5728;&#x4E3B;&#x4ECE;&#x57FA;&#x7840;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x54E8;&#x5175;&#x8282;&#x70B9;&#xFF0C;&#x54E8;&#x5175;&#x8282;&#x70B9;&#x4E0D;&#x5B58;&#x50A8;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x8D1F;&#x8D23;&#x76D1;&#x63A7;&#x4E3B;&#x4ECE;&#x8282;&#x70B9;&#x7684;&#x5065;&#x5EB7;&#xFF0C;&#x5F53;&#x4E3B;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x65F6;&#xFF0C;&#x5B83;&#x80FD;&#x53CA;&#x65F6;&#x53D1;&#x73B0;&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4ECE;&#x8282;&#x70B9;&#xFF0C;&#x5C06;&#x5176;&#x5207;&#x6362;&#x6210;&#x4E3B;&#x8282;&#x70B9;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x54E8;&#x5175;&#x672C;&#x8EAB;&#x6210;&#x4E3A;&#x5355;&#x70B9;&#xFF0C;&#x54E8;&#x5175;&#x4E00;&#x822C;&#x4E5F;&#x7531;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x4E0E;&#x54E8;&#x5175;&#x6A21;&#x5F0F;&#x89E3;&#x51B3;&#x4E86;&#x9AD8;&#x53EF;&#x7528;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x7684;&#x4F38;&#x7F29;&#x6027;&#x8FD8;&#x4E0D;&#x884C;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x65F6;&#x671F;&#x5927;&#x6570;&#x636E;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x9700;&#x6C42;&#x5728;&#x5FEB;&#x901F;&#x589E;&#x957F;&#xFF0C;&#x54EA;&#x91CC;&#x6709;&#x9700;&#x6C42;&#xFF0C;&#x54EA;&#x91CC;&#x5C31;&#x6709;&#x5E02;&#x573A;&#x3002;&#x5728;Redis&#x5B98;&#x65B9;&#x81EA;&#x5DF1;&#x7684;&#x96C6;&#x7FA4;&#x65B9;&#x6848;&#x51FA;&#x6765;&#x4E4B;&#x524D;&#xFF0C;Codis&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x5E76;&#x5F97;&#x5230;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x3002;</p>
<p>Codis&#x662F;&#x4E2D;&#x56FD;&#x4EBA;&#x5F00;&#x53D1;&#x5E76;&#x5F00;&#x6E90;&#x7684;&#xFF0C;&#x6765;&#x81EA;&#x524D;&#x8C4C;&#x8C46;&#x835A;&#x4E2D;&#x95F4;&#x4EF6;&#x56E2;&#x961F;&#x3002;Codis&#x548C;&#x540E;&#x9762;&#x7684;Redis Cluster&#x76F8;&#x4F3C;&#xFF0C;&#x5C06;&#x7279;&#x5B9A;&#x7684;key&#x5206;&#x53D1;&#x5230;&#x7279;&#x5B9A;&#x7684;Redis&#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x9ED8;&#x8BA4;&#x5C06;key&#x5316;&#x4E3A;1024&#x4E2A;&#x69FD;&#x4F4D;&#xFF1B;&#x53E6;&#x5916;Codis&#x91C7;&#x7528;zookeeper&#x6765;&#x7EF4;&#x62A4;&#x8282;&#x70B9;&#x95F4;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF1B;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x662F;Codis&#x63D0;&#x4F9B;&#x4E86;&#x975E;&#x5E38;&#x53CB;&#x597D;&#x7684;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x754C;&#x9762;&#x3002;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x53BB;&#x4E86;&#x89E3;&#x3002;&#x4F46;&#x662F;&#x5F53;Redis&#x5B98;&#x65B9;&#x7684;&#x96C6;&#x7FA4;&#x65B9;&#x6848; Redis Cluster &#x53D1;&#x5E03;&#x540E;&#xFF0C;Codis&#x7684;&#x5883;&#x9047;&#x5C31;&#x6709;&#x4E9B;&#x5C34;&#x5C2C;&#x4E86;&#x3002;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;&#x4EB2;&#x751F;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x7279;&#x6027;&#x603B;&#x6BD4;Redis&#x5B98;&#x65B9;&#x6162;&#x4E00;&#x62CD;&#x3002;</p>
<p>&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x662F;&#x521A;&#x9700;&#xFF0C;&#x6240;&#x4EE5;Redis&#x5B98;&#x65B9;&#x5728;3.0&#x7248;&#x672C;&#x63A8;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;Redis Cluster&#x3002;&#x8FD9;&#x4E2A;&#x540D;&#x8BCD;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x6B67;&#x4E49;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x4EE3;&#x8868;Redis&#x96C6;&#x7FA4;&#xFF0C;&#x800C;&#x662F;Redis&#x7684;&#x4E00;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x65B9;&#x6848;&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x7684;&#x540D;&#x79F0;&#x5C31;&#x53EB;Redis Cluster&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x4E0B;&#x8BE5;&#x65B9;&#x6848;&#x3002;</p>
<h3 id="Redis-Cluster"><a href="#Redis-Cluster" class="headerlink" title="Redis Cluster"></a>Redis Cluster</h3><p>Redis Cluster &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x65B9;&#x6848;&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#xFF0C;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x7B49;&#x9700;&#x6C42;&#x3002;</p>
<h4 id="&#x62D3;&#x6251;&#x7ED3;&#x6784;"><a href="#&#x62D3;&#x6251;&#x7ED3;&#x6784;" class="headerlink" title="&#x62D3;&#x6251;&#x7ED3;&#x6784;"></a>&#x62D3;&#x6251;&#x7ED3;&#x6784;</h4><p>&#x4E00;&#x4E2A;Redis Cluster&#x7531;&#x591A;&#x4E2A;Redis&#x8282;&#x70B9;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x8282;&#x70B9;&#x6307;&#x7684;&#x662F;Redis&#x5B9E;&#x4F8B;&#xFF0C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x53EF;&#x6309;&#x8282;&#x70B9;&#x7EC4;&#x5212;&#x5206;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#x91CC;&#x7684;&#x8282;&#x70B9;&#x5B58;&#x653E;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x662F;master&#x8282;&#x70B9;&#xFF0C;&#x540C;&#x65F6;&#x6709;0&#x5230;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#x3002;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x7EC4;&#x5B58;&#x653E;&#x7684;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x4EA4;&#x96C6;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x8282;&#x70B9;&#x7EC4;&#x7684;&#x6570;&#x636E;&#x7EC4;&#x6210;&#x8FD9;&#x4E2A;Redis Cluster&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#x96C6;&#x5408;&#x3002;</p>
<p><a class="magnific-img" href="//yongjiang043.github.io/2020/06/16/Redis&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x65B9;&#x6848;/cluster.jpg"><img src="//yongjiang043.github.io/2020/06/16/Redis&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x65B9;&#x6848;/cluster.jpg" height="200" width="300" class="ui centered image"></a></p>
<p>&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;3&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6BCF;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6709;2&#x4E2A; Redis &#x5B9E;&#x4F8B;&#x3002;&#x6807;&#x53F7;&#x76F8;&#x540C;&#x7684;&#x8282;&#x70B9;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#xFF0C;&#x4ED6;&#x4EEC;&#x5B58;&#x653E;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x6807;&#x53F7;&#x4E3A;1&#x7684;2&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#xFF0C;&#x5176;&#x4E2D;&#x6DF1;&#x8272;&#x7684;&#x4E3A;master&#x8282;&#x70B9;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E3A;slave&#x8282;&#x70B9;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5168;&#x91CF;&#x6570;&#x636E;&#x88AB;&#x5212;&#x5206;&#x4E3A;3&#x4EFD;&#xFF0C;&#x5206;&#x522B;&#x6807;&#x53F7;1/2/3&#x3002;&#x6BCF;&#x4EFD;&#x6570;&#x636E;&#x53C8;&#x6709;1&#x4E2A; slave &#x8282;&#x70B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x8FC7;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x4FDD;&#x5B58;&#x548C; master &#x8282;&#x70B9;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x65B9;&#x9762;&#xFF1A;&#x4E00;&#x662F;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#xFF0C;&#x4E8C;&#x662F;&#x6570;&#x636E;&#x6A2A;&#x5411;&#x5212;&#x5206;&#xFF0C;&#x5728; Redis &#x4E2D;&#x79F0;&#x4E3A;&#x5206;&#x7247; Sharding&#x3002;</p>
<h4 id="&#x4E3B;&#x4ECE;&#x590D;&#x5236;-Replication"><a href="#&#x4E3B;&#x4ECE;&#x590D;&#x5236;-Replication" class="headerlink" title="&#x4E3B;&#x4ECE;&#x590D;&#x5236; Replication"></a>&#x4E3B;&#x4ECE;&#x590D;&#x5236; Replication</h4><p>&#x4E3B;&#x4ECE;&#x8282;&#x70B9;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x4E3B;&#x4ECE;&#x8282;&#x70B9;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x53EA;&#x6709; master &#x8282;&#x70B9;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x6570;&#x636E;&#x88AB;&#x5199;&#x5230; master &#x8282;&#x70B9;&#x540E;&#xFF0C;&#x518D;&#x540C;&#x6B65;&#x5230; slave &#x8282;&#x70B9;&#x3002;</p>
<p>&#x4E3B;&#x4ECE;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x540C;&#x6B65;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x5168;&#x91CF;&#x540C;&#x6B65;&#x4E0E;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x3002;</p>
<h5 id="&#x5168;&#x91CF;&#x540C;&#x6B65;"><a href="#&#x5168;&#x91CF;&#x540C;&#x6B65;" class="headerlink" title="&#x5168;&#x91CF;&#x540C;&#x6B65;"></a>&#x5168;&#x91CF;&#x540C;&#x6B65;</h5><p>&#x5168;&#x91CF;&#x540C;&#x6B65;&#x4E5F;&#x79F0;&#x4E3A;&#x5FEB;&#x7167;&#x540C;&#x6B65;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x4E00;&#x6B21; bgsave &#x64CD;&#x4F5C;&#xFF0C;&#x5C06;&#x5F53;&#x524D;&#x5185;&#x5B58;&#x7684;&#x6570;&#x636E;&#x5168;&#x90E8;&#x5FEB;&#x7167;&#x5199;&#x5230;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6587;&#x4EF6;&#x540C;&#x6B65;&#x7ED9;&#x4ECE;&#x8282;&#x70B9;&#x3002;&#x4ECE;&#x8282;&#x70B9;&#x6E05;&#x7A7A;&#x5F53;&#x524D;&#x5185;&#x5B58;&#x5168;&#x90E8;&#x6570;&#x636E;&#x540E;&#x5168;&#x91CF;&#x52A0;&#x8F7D;&#x8BE5;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x8FBE;&#x5230;&#x4E0E;&#x4E3B;&#x8282;&#x70B9;&#x6570;&#x636E;&#x540C;&#x6B65;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x4ECE;&#x8282;&#x70B9;&#x52A0;&#x8F7D;&#x5FEB;&#x7167;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x8FD8;&#x5728;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x5199;&#x670D;&#x52A1;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x4ECE;&#x8282;&#x70B9;&#x52A0;&#x8F7D;&#x5B8C;&#x5FEB;&#x7167;&#x540E;&#xFF0C;&#x4F9D;&#x65E7;&#x53EF;&#x80FD;&#x4E0E;&#x4E3B;&#x8282;&#x70B9;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x4E0A;&#x573A;&#x4E86;&#x3002;</p>
<h5 id="&#x589E;&#x91CF;&#x540C;&#x6B65;"><a href="#&#x589E;&#x91CF;&#x540C;&#x6B65;" class="headerlink" title="&#x589E;&#x91CF;&#x540C;&#x6B65;"></a>&#x589E;&#x91CF;&#x540C;&#x6B65;</h5><p>&#x589E;&#x91CF;&#x540C;&#x6B65;&#x7684;&#x4E0D;&#x662F;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x4EE4;&#x6D41;&#x3002;&#x4E3B;&#x8282;&#x70B9;&#x4F1A;&#x5C06;&#x5BF9;&#x5F53;&#x524D;&#x6570;&#x636E;&#x72B6;&#x6001;&#x4EA7;&#x751F;&#x4FEE;&#x6539;&#x7684;&#x6307;&#x4EE4;&#x8BB0;&#x5F55;&#x5728;&#x5185;&#x5B58;&#x7684;&#x4E00;&#x4E2A;buffer&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5F02;&#x6B65;&#x5730;&#x5C06;buffer&#x540C;&#x6B65;&#x5230;&#x4ECE;&#x8282;&#x70B9;&#xFF0C;&#x4ECE;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x6267;&#x884C;buffer&#x4E2D;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x8FBE;&#x5230;&#x4E0E;&#x4E3B;&#x8282;&#x70B9;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p><a class="magnific-img" href="//yongjiang043.github.io/2020/06/16/Redis&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x65B9;&#x6848;/buffer.jpg"><img src="//yongjiang043.github.io/2020/06/16/Redis&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x65B9;&#x6848;/buffer.jpg" height="200" width="250" class="ui centered image"></a></p>
<p>Redis&#x7684;buffer&#x662F;&#x4E00;&#x4E2A;&#x5B9A;&#x957F;&#x7684;&#x73AF;&#x5F62;&#x7ED3;&#x6784;&#xFF0C;&#x5F53;&#x6307;&#x4EE4;&#x6D41;&#x6EE1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x8986;&#x76D6;&#x6700;&#x524D;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x4ECE;&#x8282;&#x70B9;&#x4E0A;&#x6B21;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x5BFC;&#x81F4;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x8F83;&#x957F;&#x65F6;&#xFF0C;&#x518D;&#x6B21;&#x540C;&#x6B65;&#x6307;&#x4EE4;&#x6D41;&#x65F6;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x524D;&#x9762;&#x6CA1;&#x6709;&#x540C;&#x6B65;&#x7684;&#x6307;&#x4EE4;&#x88AB;&#x8986;&#x76D6;&#x6389;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5168;&#x91CF;&#x540C;&#x6B65;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5168;&#x91CF;&#x540C;&#x6B65;&#x4E0E;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5168;&#x91CF;&#x540C;&#x6B65;&#x65F6;&#x4E00;&#x4E2A;&#x5F88;&#x8017;&#x8D44;&#x6E90;&#x4E0E;&#x65F6;&#x95F4;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x5355;&#x9760;&#x5168;&#x91CF;&#x540C;&#x6B65;&#xFF0C;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#x4F1A;&#x5F88;&#x91CD;&#xFF0C;&#x5728;&#x540C;&#x6B65;&#x7684;&#x957F;&#x65F6;&#x95F4;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x80FD;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x800C;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x6709;buffer&#x5BB9;&#x91CF;&#x9650;&#x5236;&#xFF0C;&#x4EC5;&#x4EC5;&#x9760;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x6570;&#x636E;&#x4E22;&#x5931;&#xFF0C;&#x5BFC;&#x81F4;&#x4E3B;&#x4ECE;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p>
<h4 id="&#x5206;&#x7247;-Sharding"><a href="#&#x5206;&#x7247;-Sharding" class="headerlink" title="&#x5206;&#x7247; Sharding"></a>&#x5206;&#x7247; Sharding</h4><p>&#x6240;&#x8C13;&#x5206;&#x7247;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x89C4;&#x5219;&#xFF0C;&#x5206;&#x6563;&#x5B58;&#x50A8;&#x5728;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x8FD9;&#x91CC;&#x6D89;&#x53CA;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<p>1.&#x5206;&#x7247;&#x89C4;&#x5219;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;<br><br>2.&#x5982;&#x4F55;&#x5B58;&#x50A8;&#x5728;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF1F;</p>
<p>Redis&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x5206;&#x4E3A;16384&#x4E2A;hash slot&#xFF08;&#x69FD;&#xFF09;&#xFF0C;&#x6BCF;&#x6761;&#x6570;&#x636E;&#xFF08;key-value&#xFF09;&#x6839;&#x636E;key&#x503C;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x6620;&#x5C04;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;slot&#x4E0A;&#xFF0C;&#x8FD9;&#x6761;&#x6570;&#x636E;&#x5C31;&#x5B58;&#x50A8;&#x5728;&#x8BE5;slot&#x4E2D;&#x3002;&#x6620;&#x5C04;&#x7B97;&#x6CD5;&#x662F;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">slotId=crc16(key)%16384</span><br></pre></td></tr></table></figure>
<p>Redis&#x7684;&#x6BCF;&#x4E2A;key&#x90FD;&#x4F1A;&#x57FA;&#x4E8E;&#x8BE5;&#x5206;&#x7247;&#x89C4;&#x5219;&#xFF0C;&#x843D;&#x5230;&#x7279;&#x5B9A;&#x7684;slot&#x4E0A;&#x3002;&#x800C;&#x5728;&#x96C6;&#x7FA4;&#x90E8;&#x7F72;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;slot&#x7684;&#x5206;&#x5E03;&#x5C31;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x4E86;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">172.16.190.78:7001&gt; cluster nodes</span><br><span class="line">08a5e808d2e6f6b231d73519bd4f05f74614c2a2 172.16.190.77:7000@17000 master - 0 1592218859545 3 connected 10923-16383</span><br><span class="line">2c75029ab638a48537a4c02ed0ca77a19fc4106b 172.16.190.78:7000@17000 master - 0 1592218860448 1 connected 0-5460</span><br><span class="line">50884e234c5f1ccf03f5a6d1cc4e6e6dc4779752 172.16.242.36:7000@17000 master - 0 1592218860000 2 connected 5461-10922</span><br><span class="line">d0381ef4aad364c42e08bf1c2d78168f4901bd90 172.16.190.78:7001@17001 myself,slave 08a5e808d2e6f6b231d73519bd4f05f74614c2a2 0 1592218859000 4 connected</span><br><span class="line">e5c154dcf02526b807c67bebf0a63b4c98118ffe 172.16.190.77:7001@17001 slave 50884e234c5f1ccf03f5a6d1cc4e6e6dc4779752 0 1592218861048 6 connected</span><br><span class="line">4a1b49cd77dbd18eba677663777f211be6f68dae 172.16.242.36:7001@17001 slave 2c75029ab638a48537a4c02ed0ca77a19fc4106b 0 1592218860000 5 connected</span><br></pre></td></tr></table></figure>
<p>&#x5982;&#x4E0A;&#x56FE;&#xFF0C;3&#x4E2A;master&#x8282;&#x70B9;&#xFF0C;172.16.190.77:7000&#x8282;&#x70B9;&#x5B58;&#x653E;10923-16383 slot&#xFF0C;172.16.190.78:7000&#x8282;&#x70B9;&#x5B58;&#x653E;0-5460 slot&#xFF0C;172.16.242.36:7000&#x5B58;&#x653E;5461-10922 slot&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;slot&#x7684;&#x5206;&#x5E03;&#x4E5F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x4F46;&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;slot&#x7684;&#x5206;&#x5E03;&#x9700;&#x8981;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF1A;</p>
<ul class="ui list">
<li>&#x65B0;&#x7684;master&#x52A0;&#x5165;</li>
<li>&#x8282;&#x70B9;&#x5206;&#x7EC4;&#x9000;&#x51FA;&#x96C6;&#x7FA4;</li>
<li>slot&#x5206;&#x5E03;&#x4E0D;&#x5747;&#x5300;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;slot&#x7684;&#x8FC1;&#x79FB;&#x3002;slot&#x8FC1;&#x79FB;&#x7684;&#x89E6;&#x53D1;&#x4E0E;&#x8FC7;&#x7A0B;&#x63A7;&#x5236;&#x90FD;&#x662F;&#x7531;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x5B8C;&#x6210;&#xFF0C;Redis&#x53EA;&#x63D0;&#x4F9B;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x4E0D;&#x81EA;&#x52A8;&#x8FDB;&#x884C;slot&#x8FC1;&#x79FB;&#x3002;</p>
<h4 id="MOVE-amp-ASKING"><a href="#MOVE-amp-ASKING" class="headerlink" title="MOVE &amp; ASKING"></a>MOVE &amp; ASKING</h4><p>MOVED/ASKING &#x7C7B;&#x4F3C;http&#x7684;&#x91CD;&#x5B9A;&#x5411;&#x7801;3xx&#xFF0C;&#x662F;&#x64CD;&#x4F5C;&#x7684;&#x4E00;&#x79CD;&#x9519;&#x8BEF;&#x8FD4;&#x56DE;&#x3002;</p>
<p>&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x51FA;&#x6307;&#x4EE4;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x53D1;&#x73B0;&#x6307;&#x4EE4;&#x7684;key&#x5BF9;&#x5E94;&#x7684;slot&#x4E0D;&#x5728;&#x5F53;&#x524D;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x8FD9;&#x65F6;Redis&#x4F1A;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x4E00;&#x4E2A;MOVED&#x6307;&#x4EE4;&#xFF0C;&#x544A;&#x8BC9;&#x5B83;&#x6B63;&#x786E;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x5BA2;&#x6237;&#x7AEF;&#x53BB;&#x8FDE;&#x8FD9;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x8282;&#x70B9;&#x5E76;&#x8FDB;&#x884C;&#x518D;&#x6B21;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x4E0B;&#xFF0C;15495&#x4E3A;key <em>a</em>&#x6240;&#x5728;&#x7684;slot id&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">172.16.190.78:7001&gt; get a</span><br><span class="line">(error) MOVED 15495 172.16.190.77:7000</span><br></pre></td></tr></table></figure>
<p>ASKING &#x662F;&#x5728;slot&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x9519;&#x8BEF;&#x8FD4;&#x56DE;&#x3002;&#x5F53;&#x67D0;&#x4E2A;slot&#x5728;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x4F4D;&#x4E8E;&#x8BE5;slot&#x7684;&#x67D0;&#x4E2A;key&#x7684;&#x64CD;&#x4F5C;&#x8BF7;&#x6C42;&#xFF0C;&#x8BF7;&#x6C42;&#x88AB;&#x8DEF;&#x7531;&#x5230;&#x65E7;&#x7684;&#x8282;&#x70B9;&#x3002;&#x6B64;&#x65F6;&#x8BE5;key&#x5982;&#x679C;&#x5728;&#x65E7;&#x8282;&#x70B9;&#x4E0A;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x6B63;&#x5E38;&#x64CD;&#x4F5C;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x65E7;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x8BE5;key&#x5DF2;&#x88AB;&#x8FC1;&#x79FB;&#x5230;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x5C31;&#x6CA1;&#x6709;&#x8BE5;key&#xFF0C;&#x6B64;&#x65F6;&#x4F1A;&#x8FD4;&#x56DE;ASKING&#xFF0C;&#x8BA9;&#x5BA2;&#x6237;&#x7AEF;&#x8DF3;&#x8F6C;&#x5230;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#x3002;</p>
<p>MOVED &#x4E0E; ASKING &#x7684;&#x5171;&#x540C;&#x70B9;&#x662F;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x91CD;&#x5B9A;&#x5411;&#xFF0C;&#x533A;&#x522B;&#x5728;&#x4E8E; MOVED &#x662F;&#x6C38;&#x4E45;&#x91CD;&#x5B9A;&#x5411;&#xFF0C;&#x4E0B;&#x6B21;&#x5BF9;&#x540C;&#x6837;&#x7684;key<br>&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5C31;&#x5C06;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5230;&#x6B63;&#x786E;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x800C; ASKING &#x662F;&#x4E34;&#x65F6;&#x91CD;&#x5B9A;&#x5411;&#xFF0C;&#x5B83;&#x53EA;&#x5BF9;&#x8FD9;&#x6B21;&#x64CD;&#x4F5C;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x4E0D;&#x4F1A;&#x66F4;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x69FD;&#x4F4D;&#x5173;&#x7CFB;&#x8868;&#x3002;</p>
<h4 id="&#x6545;&#x969C;&#x6062;&#x590D;"><a href="#&#x6545;&#x969C;&#x6062;&#x590D;" class="headerlink" title="&#x6545;&#x969C;&#x6062;&#x590D;"></a>&#x6545;&#x969C;&#x6062;&#x590D;</h4><p>&#x524D;&#x9762;&#x63D0;&#x5230;Redis Cluster&#x662F;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x96C6;&#x7FA4;&#x65B9;&#x6848;&#x3002;&#x6BD4;&#x5982;Codis&#x91C7;&#x7528;zookeeper&#x6765;&#x7EF4;&#x62A4;&#x8282;&#x70B9;&#x95F4;&#x72B6;&#x6001;&#x4E00;&#x81F4;&#x6027;&#xFF0C;Redis&#x54E8;&#x5175;&#x6A21;&#x5F0F;&#x662F;&#x54E8;&#x5175;&#x6765;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x4F8B;&#x5B50;&#x3002;Redis Cluster&#x6CA1;&#x6709;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x7EF4;&#x62A4;&#x8282;&#x70B9;&#x72B6;&#x6001;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x6240;&#x6709;&#x8282;&#x70B9;&#x901A;&#x8FC7;Gossip&#x534F;&#x8BAE;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#xFF0C;&#x5E7F;&#x64AD;&#x81EA;&#x5DF1;&#x7684;&#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x5BF9;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x8BA4;&#x77E5;&#x7684;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5B95;&#x6389;&#x4E86;&#xFF0C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x548C;&#x5B83;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x6539;&#x8282;&#x70B9;&#x5931;&#x8054;&#x3002;&#x5F53;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x73B0;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5931;&#x8054;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x5931;&#x8054;&#x8282;&#x70B9;&#x72B6;&#x6001;&#x53D8;&#x6210;PFail&#xFF08;possible fail&#xFF09;&#xFF0C;&#x5E76;&#x5E7F;&#x64AD;&#x7ED9;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6536;&#x5230;&#x67D0;&#x4E2A;&#x8282;&#x70B9;PFail&#x7684;&#x6570;&#x91CF;&#x8FBE;&#x5230;&#x4E86;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x5927;&#x591A;&#x6570;&#xFF0C;&#x5C31;&#x6807;&#x8BB0;&#x8BE5;&#x8282;&#x70B9;&#x4E3A;Fail&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x786E;&#x8BA4;&#x8282;&#x70B9;&#x6545;&#x969C;&#x3002;</p>
<p>&#x5F53;slave&#x53D1;&#x73B0;&#x5176;master&#x72B6;&#x6001;&#x4E3A;Fail&#x540E;&#xFF0C;&#x5B83;&#x4F1A;&#x53D1;&#x8D77;&#x9009;&#x4E3E;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4ED6;master&#x8282;&#x70B9;&#x90FD;&#x540C;&#x610F;&#xFF0C;&#x5219;&#x8BE5;slave&#x8FDB;&#x884C;&#x4ECE;&#x4E3B;&#x5207;&#x6362;&#xFF0C;&#x53D8;&#x6210;master&#x8282;&#x70B9;&#x3002;&#x540C;&#x65F6;&#x4F1A;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x72B6;&#x6001;&#x5E7F;&#x64AD;&#x7ED9;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x8FBE;&#x5230;&#x5927;&#x5BB6;&#x4FE1;&#x606F;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x6839;&#x636E;&#x4E0A;&#x9762;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x4E0B;&#x9762;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x65E0;&#x6CD5;&#x81EA;&#x52A8;&#x4ECE;&#x4E3B;&#x5207;&#x6362;&#xFF0C;&#x8FBE;&#x5230;&#x96C6;&#x7FA4;&#x7EE7;&#x7EED;&#x53EF;&#x7528;&#x76EE;&#x7684;&#x7684;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x90E8;&#x7F72;&#x65F6;&#x5E94;&#x907F;&#x514D;&#xFF1A;</p>
<ul class="ui list">
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#x4E2D;&#x7684;master&#x4E0E;slave&#x90E8;&#x7F72;&#x5728;&#x540C;&#x4E00;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#xFF0C;master&#x4E0E;salve&#x540C;&#x65F6;Fail&#x3002;</li>
<li>&#x6BD4;&#x5982;&#x603B;&#x5171;3&#x4E2A;master&#xFF0C;&#x5176;&#x4E2D;2&#x4E2A;master&#x90E8;&#x7F72;&#x5728;&#x540C;&#x4E00;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;master&#x540C;&#x65F6;Fail&#xFF0C;slave&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x4ECE;&#x4E3B;&#x5207;&#x6362;&#xFF0C;&#x56E0;&#x4E3A;PFail&#x7684;&#x6570;&#x91CF;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x5927;&#x591A;&#x6570;&#x3002;</li>
</ul>
<p>&#x5F53;&#x96C6;&#x7FA4;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x53D8;&#x5316;&#x540C;&#x6B65;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x624D;&#x80FD;&#x6839;&#x636E;&#x65B0;&#x7684;&#x96C6;&#x7FA4;&#x62D3;&#x6251;&#x6765;&#x5411;&#x6B63;&#x786E;&#x7684;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x6BD4;&#x5982;Redis&#x5BA2;&#x6237;&#x7AEF;Lettuce&#xFF0C;&#x5728;&#x8FDE;&#x63A5;&#x914D;&#x7F6E;&#x4E2D;&#x914D;&#x7F6E;&#x4E86;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;Lettuce&#x4F1A;&#x9009;&#x62E9;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002;&#x5728;&#x8FDE;&#x63A5;&#x65AD;&#x5F00;&#x4E4B;&#x524D;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x8282;&#x70B9;&#x6302;&#x6389;&#xFF0C;Lettuce&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x8282;&#x70B9;&#x5207;&#x6362;&#xFF0C;&#x6B64;&#x65F6;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x629B;&#x8FDE;&#x63A5;&#x5F02;&#x5E38;&#xFF0C;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x8BFB;&#x5199;&#x3002;Lettuce&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x8FDE;&#x63A5;&#x8FC7;&#x7A0B;&#x4E2D;&#x81EA;&#x9002;&#x5E94;&#x5237;&#x65B0;&#x96C6;&#x7FA4;&#x62D3;&#x6251;&#xFF0C;&#x5373;&#x5728;&#x8FDE;&#x63A5;&#x5931;&#x8D25;&#x65F6;&#x81EA;&#x52A8;&#x5237;&#x65B0;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x5B9A;&#x65F6;&#x5237;&#x65B0;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">ClusterTopologyRefreshOptions topologyRefreshOptions = ClusterTopologyRefreshOptions.builder()</span><br><span class="line">    .enablePeriodicRefresh(Duration.ofMinutes(10))</span><br><span class="line">    .enableAllAdaptiveRefreshTriggers()</span><br><span class="line">    .adaptiveRefreshTriggersTimeout(Duration.ofSeconds(30)).build();</span><br></pre></td></tr></table></figure>
<hr>
<p>&#x53C2;&#x8003;&#xFF1A;<br><br>1.&#x300A;&#x6DF1;&#x5165;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58; &#x4ECE;&#x539F;&#x7406;&#x5230;&#x5B9E;&#x6218;&#x300B;&#x4E8E;&#x541B;&#x6CFD; &#x66F9;&#x6D2A;&#x4F1F; &#x90B1;&#x7855;&#x7B49;&#x8457;<br><br>2.&#x300A;Redis &#x6DF1;&#x5EA6;&#x5386;&#x9669;&#xFF1A;&#x6838;&#x5FC3;&#x539F;&#x7406;&#x4E0E;&#x5E94;&#x7528;&#x5B9E;&#x8DF5;&#x300B;&#x8001;&#x94B1;<br><br>3.Redis&#x5B98;&#x7F51;&#xFF1A;<a href="https://lettuce.io/core/release/reference/index.html" target="_blank" rel="noopener">https://lettuce.io/core/release/reference/index.html</a></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2020-06-16T10:56:38.000Z" itemprop="datePublished">2020-06-16</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a class="ui tiny button disabled"><i class="angle left icon"></i>Previous</a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2020/06/04/Redis Cluster安装/" class="ui tiny button">
                    
                    Redis Cluster 安装
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#为什么要分布式"><span>为什么要分布式</span></a></li><li><a href="#分布式解决方案"><span>分布式解决方案</span></a><ol><li><a href="#历史发展"><span>历史发展</span></a></li><li><a href="#Redis-Cluster"><span>Redis Cluster</span></a><ol><li><a href="#拓扑结构"><span>拓扑结构</span></a></li><li><a href="#主从复制-Replication"><span>主从复制 Replication</span></a><ol><li><a href="#全量同步"><span>全量同步</span></a></li><li><a href="#增量同步"><span>增量同步</span></a></li></ol></li><li><a href="#分片-Sharding"><span>分片 Sharding</span></a></li><li><a href="#MOVE-amp-ASKING"><span>MOVE & ASKING</span></a></li><li><a href="#故障恢复"><span>故障恢复</span></a></li></ol></li></ol></li></ol>
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        Copyright &copy; 2020 <a href="/">mustone</a>
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
